In [1]:
import numpy as np
import pandas as pd

In [2]:
# Series or Dataframe followed by .str will show a lot of ufnctions for string manipualtion
names = pd.Series(['andrew', 'bobo', 'claire', 'david', '5'])
names

0    andrew
1      bobo
2    claire
3     david
4         5
dtype: object

In [3]:
names.str.upper() # uppercase all the data

0    ANDREW
1      BOBO
2    CLAIRE
3     DAVID
4         5
dtype: object

In [4]:
# checking for the datatype 
names.str.isdigit() # will return true on 5

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [5]:
tech_finance = ['GOOG,APPL,AMZN', 'JPM,BAC,GS']

In [6]:
tickers = pd.Series(tech_finance)
tickers # not formated correctly

0    GOOG,APPL,AMZN
1        JPM,BAC,GS
dtype: object

In [7]:
tickers.str.split(',') # will split each row into a list of the elements inside

0    [GOOG, APPL, AMZN]
1        [JPM, BAC, GS]
dtype: object

In [8]:
# now we want to make them into 3 columns
tickers.str.split(',', expand = True) # expand automatically does the job for us

      0     1     2
0  GOOG  APPL  AMZN
1   JPM   BAC    GS

In [9]:
tickers.str.split(',' , expand= True)

      0     1     2
0  GOOG  APPL  AMZN
1   JPM   BAC    GS

In [10]:
messy_names = pd.Series(['andrew  ', 'bo;bo', '  claire'])
messy_names # the names are messy

0    andrew
1       bo;bo
2      claire
dtype: object

In [11]:
# first string - what you want to replace
# second string - what will it be replaced with
messy_names.str.replace(';', '')

0    andrew
1        bobo
2      claire
dtype: object

In [12]:
# str.strip() will remove the whitespace
messy_names.str.replace(';', '').str.strip().str.capitalize()
# will remove the whitespace
# Capitalize will capitalize the first letter

0    Andrew
1      Bobo
2    Claire
dtype: object

In [13]:
# if we have really hard operations we can apply a custom call
def cleanup(name):
    name = name.replace(";", "")
    name = name.strip()
    name = name.capitalize()
    return name

In [14]:
messy_names.apply(cleanup)

0    Andrew
1      Bobo
2    Claire
dtype: object

Pandas str method calls will perform slower than our defined functions, we can always vectorize to imporve performance though

In [15]:
np.vectorize(cleanup)(messy_names)

array(['Andrew', 'Bobo', 'Claire'], dtype='<U6')

# Time Methods and Formating

Python has a datetime object, python has dt methods used for manipulating these objects

In [16]:
from datetime import datetime

In [17]:
myyear = 2015
mymonth = 1
myday = 1
myhour = 2
mymin = 30
mysec = 15

In [18]:
mydate = datetime(myyear, mymonth, myday) # the neccessary elements for a date
mydate

datetime.datetime(2015, 1, 1, 0, 0)

In [19]:
mydatetime = datetime(myyear, mymonth, myday, myhour, mymin, mysec) # this is morespecifci
mydatetime

datetime.datetime(2015, 1, 1, 2, 30, 15)

In [20]:
mydatetime.year # we can select attributes

2015

In [21]:
mydatetime.month # will get the month attribute

1

In [22]:
myser = pd.Series(['Nov 3, 1990' , '2000-01-01', None])
myser # panda considers them strings

0    Nov 3, 1990
1     2000-01-01
2           None
dtype: object

We have to convert the string objects to datetime format

In [23]:
# There are default formats in to_datetime()
timeser = pd.to_datetime(myser)
timeser

0   1990-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [24]:
timeser[0].year

1990

In [25]:
obvi_euro_date = '31-12-2000' # this is an europian date
pd.to_datetime(obvi_euro_date)

/tmp/ipykernel_4327/184732044.py:2: UserWarning: Parsing '31-12-2000' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  pd.to_datetime(obvi_euro_date)

Timestamp('2000-12-31 00:00:00')

Pandas uses american style dates, above it is obious that the first value is the date

In [26]:
# to switch to european we pass the parameter dayfirst
euro_date = '10-12-2000'
pd.to_datetime(euro_date, dayfirst=True)

Timestamp('2000-12-10 00:00:00')

What about different dataformats

In [27]:
style_date = '12--Dec--2000' # we pass a string code to the format 
                             # check the documentation learn more about the formating
                             #     day month year
pd.to_datetime(style_date, format='%d--%b--%Y')

Timestamp('2000-12-12 00:00:00')

In [28]:
# python is really flexible with dates
custom_date = '12th of Dec 2000'
pd.to_datetime(custom_date)

Timestamp('2000-12-12 00:00:00')

Reading data from a csv file

In [29]:
sales = pd.read_csv('/home/zaimi/Downloads/UNZIP_FOR_NOTEBOOKS_FINAL/03-Pandas/RetailSales_BeerWineLiquor.csv')
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [30]:
sales.info() # as it can be seen DATE column is a string

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    object
 1   MRTSSM4453USN  340 non-null    int64
dtypes: int64(1), object(1)
memory usage: 5.4+ KB

In [31]:
sales['DATE']

0      1992-01-01
1      1992-02-01
2      1992-03-01
3      1992-04-01
4      1992-05-01
          ...
335    2019-12-01
336    2020-01-01
337    2020-02-01
338    2020-03-01
339    2020-04-01
Name: DATE, Length: 340, dtype: object

In [32]:
sales['DATE'] = pd.to_datetime(sales['DATE'])
sales['DATE']
# It will be converted to datetime64

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [33]:
sales['DATE'][0].year # get a year of the element

1992

You can parse the date quiclky while importing the dataset

In [34]:
# The argument it takes is a list of indexes we want to be treated as dates
sales = pd.read_csv('/home/zaimi/Downloads/UNZIP_FOR_NOTEBOOKS_FINAL/03-Pandas/RetailSales_BeerWineLiquor.csv', parse_dates=[0])
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [35]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    datetime64[ns]
 1   MRTSSM4453USN  340 non-null    int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 5.4 KB

Resampling - Making the datetime the index

In [36]:
sales = sales.set_index('DATE')
sales

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2019-12-01           6630
2020-01-01           4388
2020-02-01           4533
2020-03-01           5562
2020-04-01           5207

[340 rows x 1 columns]

In [37]:
# now that the index is the date we can use .resample() to groupby specific datetime parameters
# rule='A' means to group by the year
sales.resample(rule='A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000